[{
  
  "stateId": "1",
  "stateName": "Madhya Pradesh",
  "stateDescription": "Madhya Pradesh, often referred to as the 'Heart of India', is renowned for its rich heritage, historical landmarks, and natural beauty. The state is home to UNESCO World Heritage Sites, famous wildlife sanctuaries, and a blend of culture, making it a prominent tourist destination in India. From the ancient temples of Khajuraho to the majestic forts and palaces, every corner of Madhya Pradesh tells a story of India’s glorious past.",
  "cities": [
    {
      
      "cityId": "101",
      "cityName": "Indore",
      "cityDescription": "Indore is the largest city of Madhya Pradesh, known for its unique blend of traditional and modern culture. With a rich history dating back to the Holkar dynasty, Indore offers a range of architectural marvels, temples, and vibrant markets. Famous for its food culture, Indore is also a paradise for food lovers with its bustling Sarafa and Chappan Dukan night food markets.",
      "popularCity": "true",
      "bestTimeToVisit": "October to March",
      "placesToVisit": [
        {
          
          "placeId": "1011",
          "placeName": "Rajwada",
          "description": "Rajwada is a seven-story historical palace located in the heart of Indore, built by the Holkar dynasty over 200 years ago. This majestic structure showcases a unique blend of Maratha, Mughal, and French architecture, reflecting the rich history of the Holkar rulers. The palace grounds offer beautiful gardens and a grand entrance, giving visitors a glimpse into royal life. Today, it stands as a cultural hub, hosting various events and festivals.",
          "location": "MG Road, Indore",
          "popularDestination": "true"
        },
        {
          
          "placeId": "1012",
          "placeName": "Khajrana Ganesh Mandir",
          "description": "Khajrana Ganesh Mandir is one of the most revered Hindu temples in Indore, dedicated to Lord Ganesh. Built by Rani Ahilyabai Holkar, this temple is known for its peaceful atmosphere and the intricate carvings on its idols. Devotees from all over India visit this temple to seek blessings, and it is especially crowded during the Ganesh festival. The temple complex is also home to other deities, making it a significant religious site.",
          "location": "Khajrana, Indore",
          "popularDestination":"true"

        },
        {
          
          "placeId": "1013",
          "placeName": "Regional Park",
          "description": "Also known as Pipliyapala Regional Park, this sprawling green space offers a refreshing escape with its scenic lake, boating facilities, and beautifully landscaped gardens. It features musical fountains, open spaces, and play areas, making it a popular spot for families. Visitors can enjoy paddle boating, lush picnic spots, and a delightful evening atmosphere that is perfect for unwinding.",
          "location": "Near Pipliyapala Lake, Indore",
          "popularDestination":"true"
        }
      ],
      "historicalPlaces": [
        {
          
          "placeId": "1014",
          "placeName": "Lal Bagh Palace",
          "description": "Lal Bagh Palace, a grand building from the Holkar era, is an epitome of architectural excellence, showcasing European-style décor and Victorian architecture. The interiors, adorned with exquisite chandeliers, Persian carpets, and marble pillars, offer a glimpse into the opulent lifestyle of the Holkar rulers. Set amidst sprawling gardens, the palace also houses a beautiful ballroom and is surrounded by lush landscapes, perfect for a serene experience.",
          "location": "Lalbagh Road, Indore",
          "popularDestination":"false"
        },
        {
          
          "placeId": "1015",
          "placeName": "Chhatris",
          "description": "The Chhatris of Indore are intricately designed cenotaphs built in memory of the Holkar rulers. These marble structures, with detailed carvings and domed pavilions, reflect the Maratha architectural style. Located near the Khan River, the Chhatris are especially stunning when illuminated at night, creating a picturesque view against the serene river backdrop. They offer a serene ambiance for history enthusiasts and visitors alike.",
          "location": "Raoji Bazaar, Indore",
          "popularDestination":"false"
        }
      ]
    },
    {  
      "cityId": "102",
      "cityName": "Bhopal",
      "cityDescription": "Bhopal, the capital of Madhya Pradesh, is known as the 'City of Lakes' due to its two beautiful lakes, Upper and Lower Lake, that enhance the city's scenic beauty. Bhopal offers a fascinating mix of history, culture, and nature, with attractions ranging from ancient monuments to modern museums. The city is also known for its vibrant markets, Mughlai cuisine, and the historic sites that reflect a blend of Islamic and Hindu influences.",
      "popularCity": "true",
      "bestTimeToVisit": "November to February",
      "placesToVisit": [
        {
          
          "placeId": "1021",
          "placeName": "Upper Lake",
          "description": "Upper Lake, also known as 'Bhojtal', is a massive artificial lake created in the 11th century. It’s a popular destination for locals and tourists alike, offering various water activities like boating and kayaking. Surrounded by lush greenery, it provides breathtaking views, especially during sunrise and sunset. The lake serves as a source of drinking water and is a testament to Bhopal’s rich history and environmental significance.",
          "location": "Bhopal Lakefront, Bhopal",
          "popularDestination":"true"
        },
        {
          
          "placeId": "1022",
          "placeName": "Van Vihar National Park",
          "description": "Van Vihar National Park is a wildlife sanctuary located in the heart of Bhopal, offering a unique blend of nature conservation and recreation. It houses a variety of animal species, including tigers, leopards, bears, and crocodiles, in a semi-natural environment. The park is an ideal destination for nature lovers and wildlife enthusiasts, providing a rare opportunity to witness animals in their natural habitats while enjoying the scenic surroundings.",
          "location": "VIP Road, Bhopal",
          "popularDestination":"false"
        }
      ],
      "historicalPlaces": [
        {
          
          "placeId": "1023",
          "placeName": "Sanchi Stupa",
          "description": "Sanchi Stupa is a UNESCO World Heritage Site and one of India’s oldest Buddhist monuments, dating back to the 3rd century BCE. Built by Emperor Ashoka, this ancient structure symbolizes peace and non-violence. The Stupa features gateways adorned with intricate carvings that depict scenes from the Buddha’s life. Sanchi offers an immersive experience for visitors, taking them on a journey through history, art, and spirituality.",
          "location": "Sanchi, near Bhopal",
          "popularDestination":"true"
        }
      ]
    }
  ]
},

{
  "stateId": "2",
  "stateName": "Rajasthan",
  "stateDescription": "Rajasthan, known as the 'Land of Kings,' is a state rich in royal history, culture, and heritage. Famous for its magnificent forts, palaces, and vibrant traditions, Rajasthan offers an unforgettable experience to travelers. The state is home to the Thar Desert, which features stunning sand dunes, camel rides, and beautiful lakes. Its cities like Jaipur, Udaipur, Jodhpur, and Jaisalmer are iconic for their architectural marvels, colorful bazaars, and royal traditions. Rajasthan celebrates an array of festivals and boasts a rich cuisine, making it a must-visit destination for history lovers and adventurers alike.",
  "cities": [
    {
      
      "cityId": "201",
      "cityName": "Jaipur",
      "cityDescription": "Jaipur, the capital of Rajasthan, is also known as the 'Pink City' for its pink-colored buildings. The city is famous for its stunning palaces, forts, and temples. Jaipur showcases a unique blend of Rajput and Mughal architecture. From the grand Amber Fort to the intricate Hawa Mahal, the city offers a glimpse of Rajasthan’s royal heritage. The bustling bazaars, colorful markets, and traditional Rajasthani cuisine make Jaipur a vibrant place to visit.",
      "popularCity": "true",
      "bestTimeToVisit": "October to March",
      "placesToVisit": [
        {
          
          "placeId": "2011",
          "placeName": "Amber Fort",
          "description": "Amber Fort is a majestic fortress located in the Aravalli hills, just outside Jaipur. Built with a combination of red sandstone and marble, Amber Fort offers a glimpse into the opulent lifestyle of Rajasthan’s Rajput kings. Visitors can enjoy elephant rides up to the main gate and explore the fort’s intricate architecture, including its Sheesh Mahal (Mirror Palace), reflecting pools, and expansive courtyards.",
          "location": "Amber, Jaipur",
          "popularDestination":"false"
        },
        {
          
          "placeId": "2012",
          "placeName": "Hawa Mahal",
          "description": "Hawa Mahal, also known as the 'Palace of Winds', is a five-story structure made from red and pink sandstone. Its 953 small windows, designed to allow royal women to observe street life without being seen, give the building a unique look. The palace is a blend of Rajput and Mughal architectural styles, and its delicate latticework makes it one of Jaipur's most iconic landmarks.",
          "location": "Badi Choupad, Jaipur",
          "popularDestination":"true"


        }
      ],
      "historicalPlaces": [
        {
          
          "placeId": "2013",
          "placeName": "City Palace jaipur",
          "description": "The City Palace of Jaipur is a stunning complex of courtyards, gardens, and palaces. Built by Maharaja Sawai Jai Singh II, the palace reflects a blend of Mughal and Rajasthani architecture. It houses several museums displaying royal artifacts, costumes, and paintings. The beautiful Chandra Mahal within the palace complex is still home to the Maharaja of Jaipur.",
          "location": "City Palace Complex, Jaipur"
        }
      ]
    },
    {
      
      "cityId": "202",
      "cityName": "Udaipur",
      "cityDescription": "Udaipur, known as the 'City of Lakes,' is famous for its picturesque beauty, regal palaces, and tranquil lakes. The city features the iconic Lake Pichola and the stunning City Palace. Udaipur is rich in Rajasthani culture, with traditional music, dance, and handicrafts adding to its charm. The lakeside resorts and majestic palaces make Udaipur a romantic getaway, offering a perfect blend of natural beauty and royal architecture.",
      "popularCity": "true",
      "bestTimeToVisit": "October to March",
      "placesToVisit": [
        {
          
          "placeId": "2021",
          "placeName": "Lake Pichola",
          "description": "Lake Pichola is an artificial freshwater lake in Udaipur, famous for its serene beauty. Visitors can enjoy boat rides on the lake, which offers stunning views of the City Palace, Jag Mandir, and the surrounding hills. The lake is particularly beautiful at sunset, making it one of Udaipur’s top tourist destinations.",
          "location": "Lake Pichola, Udaipur"
        },
        {
          
          "placeId": "2022",
          "placeName": "Jag Mandir",
          "description": "Jag Mandir is an island palace situated on Lake Pichola. Built in the 17th century, the palace is a beautiful blend of Rajput and Mughal architecture. The palace offers a peaceful retreat with its scenic views, lovely gardens, and tranquil ambiance. It’s a popular spot for boat rides and is known for its stunning sunset views.",
          "location": "Lake Pichola, Udaipur"
        }
      ],
      "historicalPlaces": [
        {
          
          "placeId": "2023",
          "placeName": "City Palace Udaipur",
          "description": "The City Palace of Udaipur is a grand architectural marvel that overlooks Lake Pichola. Built over a period of 400 years, it combines Rajasthani and Mughal styles, with intricate carvings, beautiful courtyards, and vibrant frescoes. The palace also houses museums and is an excellent spot to witness Udaipur’s royal history and cultural heritage.",
          "location": "City Palace Complex, Udaipur"
        }
      ]
    },
    {
      
      "cityId": "203",
      "cityName": "Jodhpur",
      "cityDescription": "Jodhpur, also known as the 'Blue City' for its blue-painted houses, is famous for its majestic Mehrangarh Fort and stunning palaces. The city’s old town is dotted with narrow lanes, colorful markets, and ancient temples. Jodhpur’s royal history, vibrant bazaars, and beautiful architectural landmarks make it one of Rajasthan’s most visited cities. The city is also known for its textiles, handicrafts, and traditional Rajasthani cuisine.",
      "popularCity": "false",
      "bestTimeToVisit": "October to March",
      "placesToVisit": [
        {
          
          "placeId": "2031",
          "placeName": "Mehrangarh Fort",
          "description": "Mehrangarh Fort is one of the largest and most well-preserved forts in India. Located on a hilltop, it offers panoramic views of Jodhpur and its surroundings. The fort is known for its intricate carvings, expansive courtyards, and impressive architecture. Inside the fort, you can explore a museum showcasing artifacts from Rajasthan's royal history.",
          "location": "Mehrangarh Fort, Jodhpur"
        },
        {  
          "placeId": "2032",
          "placeName": "Umaid Bhawan Palace",
          "description": "Umaid Bhawan Palace is an architectural gem built during the reign of Maharaja Umaid Singh. The palace features a unique blend of Indo-Saracenic and Art Deco styles. It’s one of the world’s largest private residences, with parts of it serving as a museum and luxury hotel. The palace offers insight into Jodhpur’s royal history and is surrounded by lush gardens.",
          "location": "Umaid Bhawan Palace, Jodhpur"
        }
      ],
      "historicalPlaces": [
        {
          
          "placeId": "2033",
          "placeName": "Jaswant Thada",
          "description": "Jaswant Thada is a beautiful marble cenotaph located near Mehrangarh Fort, built in memory of Maharaja Jaswant Singh II. The cenotaph’s intricate carvings, tranquil surroundings, and the picturesque lake make it a peaceful spot for visitors. It’s an ideal location for photography and to learn about the city’s royal past.",
          "location": "Jaswant Thada, Jodhpur"
        }
      ]
    }
  ]
},
{

  
  "stateId": "3",
  "stateName": "Maharashtra",
  "stateDescription": "Maharashtra, located on the western coast of India, is a state of rich culture, history, and natural beauty. Known for its bustling cities, tranquil beaches, hill stations, and ancient forts, Maharashtra offers a diverse range of experiences. The state’s capital, Mumbai, is the financial capital of India and is famous for its nightlife, film industry (Bollywood), and historical landmarks. Maharashtra is also home to the famous Ajanta and Ellora caves, the hill stations of Lonavala and Mahabaleshwar, and the beautiful beaches of Goa.",
  "cities": [
    {
      
      "cityId": "301",
      "cityName": "Mumbai",
      "cityDescription": "Mumbai, formerly known as Bombay, is India’s largest city and the financial capital. It is a city of contrasts, where ancient traditions coexist with modern aspirations. Mumbai is famous for its historical sites, buzzing markets, wide-ranging cuisine, and vibrant nightlife. The city is also the hub of India’s film industry, Bollywood. Visitors can explore colonial-era architecture, visit iconic sites such as the Gateway of India, Marine Drive, and experience the city's diverse cultural heritage.",
      "popularCity":"true",
      "bestTimeToVisit": "November to February",
      "placesToVisit": [
        {
          
          "placeId": "3011",
          "placeName": "Gateway of India",
          "description": "The Gateway of India is an iconic arch monument built during the 20th century to commemorate King George V's visit to India. The monument is located on the waterfront in South Mumbai, overlooking the Arabian Sea. The Gateway is a beautiful blend of Hindu and Muslim architectural styles and is one of Mumbai’s most famous landmarks.",
          "location": "Colaba, Mumbai"
        },
        {
          
          "placeId": "3012",
          "placeName": "Chhatrapati Shivaji Maharaj Terminus",
          "description": "Chhatrapati Shivaji Maharaj Terminus (CST), formerly Victoria Terminus, is an architectural masterpiece and UNESCO World Heritage site. Built in the Victorian Gothic style, it is one of the busiest railway stations in India. The terminus stands as a symbol of Mumbai's colonial past and is renowned for its ornate details and stunning facade.",
          "location": "Fort, Mumbai"
        }
      ],
      "historicalPlaces": [
        {
          
          "placeId": "3013",
          "placeName": "Elephanta Caves",
          "description": "The Elephanta Caves are a collection of ancient rock-cut temples located on Elephanta Island, near Mumbai. These caves are dedicated to the Hindu god Shiva and date back to the 5th and 8th centuries. The largest cave features an awe-inspiring sculpture of Trimurti, a three-headed representation of Lord Shiva.",
          "location": "Elephanta Island, Mumbai"
        }
      ]
    },
    {

      
      "cityId": "302",
      "cityName": "Pune",
      "cityDescription": "Pune, known as the 'Oxford of the East,' is a city of intellectual and cultural significance. It is a thriving hub for education, technology, and arts. Pune is surrounded by picturesque hills and offers a blend of modern amenities with a historical charm. Visitors can explore ancient temples, visit the famous Aga Khan Palace, and enjoy the city's vibrant cultural life, especially its classical music and dance scene.",
      "popularCity": "true",
      "bestTimeToVisit": "October to February",
      "placesToVisit": [
        {
          
          "placeId": "3021",
          "placeName": "Aga Khan Palace",
          "description": "Aga Khan Palace is a historical landmark in Pune, known for its architectural grandeur. Built in 1892, it has played a significant role in India’s independence movement, as it was the place where Mahatma Gandhi was imprisoned during the Quit India Movement. The palace features beautiful gardens and is a must-visit for history enthusiasts.",
          "location": "Aga Khan Palace, Pune"
        },
        {
          
          "placeId": "3022",
          "placeName": "Shaniwar Wada",
          "description": "Shaniwar Wada is a historical fortification that was the seat of the Peshwa rulers of the Maratha Empire. The structure is known for its intricate architecture, large wooden doors, and a fascinating history of intrigue and betrayal. Although the fort has been partially destroyed by fire, it still remains a significant historical monument in Pune.",
          "location": "Shaniwar Peth, Pune"
        }
      ],
      "historicalPlaces": [
        {
          
          "placeId": "3023",
          "placeName": "Raja Dinkar Kelkar Museum",
          "description": "The Raja Dinkar Kelkar Museum houses an extensive collection of artifacts, antiques, and sculptures from across India. It provides visitors with a glimpse into India's rich cultural history, with exhibits ranging from musical instruments to decorative arts and everyday objects.",
          "location": "Shivaji Nagar, Pune"
        }
      ]
    },
    {
      
      "cityId": "303",
      "cityName": "Aurangabad",
      "cityDescription": "Aurangabad, a city steeped in history, is known for its rich cultural heritage and medieval architecture. It is home to the famous Ajanta and Ellora Caves, both UNESCO World Heritage sites. Aurangabad also boasts impressive Mughal monuments like Bibi Ka Maqbara, which is often referred to as the 'Taj of the Deccan.' The city's proximity to historic sites and its vibrant atmosphere make it an important tourist destination.",
      "popularCity": "false",
      "bestTimeToVisit": "October to March",
      "placesToVisit": [
        {
          
          "placeId": "3031",
          "placeName": "Ajanta Caves",
          "description": "The Ajanta Caves are a group of rock-cut Buddhist cave temples dating back to the 2nd century BCE. The caves are known for their intricate sculptures, paintings, and Buddhist artwork that provide a glimpse into ancient Indian life. They are considered one of the finest examples of ancient Indian art and architecture.",
          "location": "Ajanta, Aurangabad"
        },
        {
          
          "placeId": "3032",
          "placeName": "Ellora Caves",
          "description": "The Ellora Caves are another UNESCO World Heritage site, famous for their rock-cut temples and monasteries. The caves span over 2 kilometers and contain over 30 temples, showcasing a blend of Buddhist, Hindu, and Jain architecture. The Kailasa Temple, carved from a single monolithic rock, is a remarkable achievement of ancient Indian engineering.",
          "location": "Ellora, Aurangabad"
        }
      ],
      "historicalPlaces": [
        {
          
          
          "placeId": "3033",
          "placeName": "Bibi Ka Maqbara",
          "description": "Bibi Ka Maqbara is a beautiful Mughal mausoleum built by Azam Shah in memory of his mother, Empress Rabia-ul-Durrani. The structure closely resembles the Taj Mahal in its design and stands as an important historical landmark in Aurangabad.",
          "location": "Bibi Ka Maqbara, Aurangabad"
        }
      ]
    }
  ]
},
{
  
  
  "stateId": "4",
  "stateName": "Uttar Pradesh",
  "stateDescription": "Uttar Pradesh, located in the northern part of India, is one of the most culturally rich and historically significant states in the country. The state is home to several iconic landmarks, such as the Taj Mahal in Agra, the holy city of Varanasi, and the ancient city of Mathura. Uttar Pradesh is also known for its traditional crafts, vibrant festivals, and spiritual heritage. With its diverse culture and historical significance, Uttar Pradesh is a must-visit for history enthusiasts and spiritual seekers.",
  "cities": [
    {
      
      "cityId": "401",
      "cityName": "Agra",
      "cityDescription": "Agra, located on the banks of the Yamuna River, is one of India's most famous tourist destinations, primarily known for the Taj Mahal, one of the Seven Wonders of the World. The city has a rich Mughal history, reflected in its stunning architecture, including the Agra Fort and Fatehpur Sikri. Agra’s traditional crafts, such as marble inlay work, also attract visitors. The city's historic charm, coupled with its proximity to Delhi, makes it a key stop for tourists exploring northern India.",
      "popularCity": "true",
      "bestTimeToVisit": "October to March",
      "placesToVisit": [
        {
          
          "placeId": "4011",
          "placeName": "Taj Mahal",
          "description": "The Taj Mahal is an iconic symbol of love, built by Mughal Emperor Shah Jahan in memory of his wife Mumtaz Mahal. This majestic white marble mausoleum is known for its stunning architecture, intricate carvings, and serene gardens. It is one of the most photographed monuments in the world and attracts millions of visitors every year.",
          "location": "Taj Mahal Complex, Agra"
        },
        {
          
          "placeId": "4012",
          "placeName": "Agra Fort",
          "description": "Agra Fort, a UNESCO World Heritage site, was the main residence of the Mughal emperors until the capital was moved to Delhi. The fort showcases grand Mughal architecture with its impressive gates, palaces, and mosques. The fort's strategic location along the Yamuna River made it a formidable structure during the Mughal era.",
          "location": "Agra Fort, Agra"
        }
      ],
      "historicalPlaces": [
        {
          
          "placeId": "4013",
          "placeName": "Fatehpur Sikri",
          "description": "Fatehpur Sikri is a historical city built by Emperor Akbar in the 16th century. It served as the Mughal Empire’s capital for a brief period. The city is famous for its grand architecture, including the Jama Masjid, Buland Darwaza, and the Tomb of Salim Chishti. The city’s well-preserved ruins offer a glimpse into the Mughal era.",
          "location": "Fatehpur Sikri, Agra"
        }
      ]
    },
    {
      
      "cityId": "402",
      "cityName": "Varanasi",
      "cityDescription": "Varanasi, also known as Kashi, is one of the oldest living cities in the world and the spiritual capital of India. Located on the banks of the Ganges River, Varanasi is famous for its ghats, temples, and vibrant religious culture. The city is a hub for Hindu pilgrimage, attracting millions of devotees and tourists every year. Varanasi’s narrow lanes, historic temples, and spiritual rituals provide a unique experience for visitors seeking spiritual awakening and cultural immersion.",
      "popularCity": "false",
      "bestTimeToVisit": "November to February",
      "placesToVisit": [
        {
          
          "placeId": "4021",
          "placeName": "Kashi Vishwanath Temple",
          "description": "Kashi Vishwanath Temple is one of the most famous and sacred temples in India, dedicated to Lord Shiva. The temple’s history dates back to ancient times and it attracts millions of pilgrims every year. It is located near the ghats of Varanasi and is an essential part of the city’s spiritual heritage.",
          "location": "Kashi Vishwanath Temple, Varanasi"
        },
        {
          
          "placeId": "4022",
          "placeName": "Dashashwamedh Ghat",
          "description": "Dashashwamedh Ghat is one of the most famous ghats in Varanasi, where devotees perform ritual baths and light lamps in honor of the Ganges River. The evening Ganga Aarti at this ghat is a mesmerizing spectacle, attracting visitors from around the world to witness the divine ceremony.",
          "location": "Dashashwamedh Ghat, Varanasi"
        }
      ],
      "historicalPlaces": [
        {
          
          "placeId": "4023",
          "placeName": "Sarnath",
          "description": "Sarnath is an important Buddhist site located near Varanasi, where Lord Buddha delivered his first sermon after attaining enlightenment. The site is home to several ancient stupas, temples, and the Dhamek Stupa. It is a significant pilgrimage destination for Buddhists worldwide.",
          "location": "Sarnath, Varanasi"
        }
      ]
    },
    {
      
      "cityId": "403",
      "cityName": "Mathura",
      "cityDescription": "Mathura, the birthplace of Lord Krishna, is a major pilgrimage destination for Hindus. The city is known for its temples, ghats, and religious festivals like Holi and Janmashtami. Mathura’s vibrant culture and rich history are deeply tied to the life of Lord Krishna, with several temples dedicated to him and his followers. The city's historic landmarks and religious significance make it an important stop for spiritual travelers.",
      "popularCity": "true",
      "bestTimeToVisit": "October to March",
      "placesToVisit": [
        {
          
          
          "placeId": "4031",
          "placeName": "Krishna Janmabhoomi Temple",
          "description": "The Krishna Janmabhoomi Temple is the birthplace of Lord Krishna and one of the holiest sites for Hindus. The temple complex consists of a shrine marking Krishna’s birthplace, as well as several smaller temples and a sacred pond. The temple is beautifully adorned and attracts pilgrims from all over the world.",
          "location": "Krishna Janmabhoomi, Mathura"
        },
        {
          
          "placeId": "4032",
          "placeName": "Vishram Ghat",
          "description": "Vishram Ghat is one of the most important ghats in Mathura, where it is believed that Lord Krishna rested after killing the tyrant Kamsa. The ghat is lined with temples and is a key location for religious rituals, especially during festivals like Janmashtami and Holi.",
          "location": "Vishram Ghat, Mathura"
        }
      ],
      "historicalPlaces": [
        {
          
          "placeId": "4033",
          "placeName": "Dwarkadhish Temple",
          "description": "Dwarkadhish Temple is a revered temple dedicated to Lord Krishna, located in the heart of Mathura. The temple is known for its beautiful architecture and serene ambiance. It holds immense religious significance and is visited by millions of devotees, especially during the festival of Janmashtami.",
          "location": "Dwarkadhish Temple, Mathura"
        }
      ]
    }
  ]
}]